import Image from "next/image";
import Link from "next/link";

export default function Agree1() {
  return (
    <div className="flex flex-col content-center items-center w-full h-full">
      <div className="flex flex-col content-center items-center w-full max-w-[500px] h-screen bg-[#FCFCFF]">
        <div className="top-0 mt-[28px] flex w-full justify-between items-center h-[36px] px-4">
          <div className="size-[17px]" />
          <div className="text-[18px] font-bold">이용약관</div>
          <a href="/signup">
            <Image
              src="/assets/icons/close.svg"
              width={17}
              height={17}
              alt="logo"
            />
          </a>
        </div>
        <div className="mt-[29px] text-[12px] flex flex-col px-4 items-start w-full h-full">
          제 1 장 총칙 제 1 조 (목적) 본 약관은 구름톤 유니브 주최 벚꽃톤이
          운영하는 돈버니(이하 돈버니)에서 제공하는 모든 서비스(이하 서비스)의
          이용조건 및 절차, 이용자와 당 사이트의 권리, 의무, 책임사항과 기타
          필요한 사항을 규정함을 목적으로 합니다. 제 2 조 (약관의 효력과 변경) ①
          당 사이트는 이용자가 본 약관 내용에 동의하는 것을 조건으로 이용자에게
          서비스를 제공하며, 당 사이트의 서비스 제공 행위 및 이용자의 서비스
          사용 행위에는 본 약관을 우선적으로 적용하겠습니다. ② 당 사이트는 본
          약관을 사전 고지 없이 변경할 수 있으며, 변경된 약관은 당 사이트 내에
          공지함으로써 이용자가 직접 확인하도록 할 것입니다. 이용자가 변경된
          약관에 동의하지 아니하는 경우 본인의 회원등록을 취소(회원탈퇴)할 수
          있으며, 계속 사용할 경우에는 약관 변경에 대한 암묵적 동의로
          간주됩니다. 변경된 약관은 공지와 동시에 그 효력을 발휘합니다. 제 3 조
          (약관 외 준칙) 본 약관에 명시되지 않은 사항은 전기통신기본법,
          전기통신사업법, 정보통신망 이용촉진 및 정보보호 등에 관한 법률 및 기타
          관련 법령의 규정에 의합니다. 제 4 조 (용어의 정의) ① 본 약관에서
          사용하는 용어의 정의는 다음과 같습니다. 1. 이용자 : 본 약관에 따라 당
          사이트가 제공하는 서비스를 받는 자 2. 가 입 : 당 사이트가 제공하는
          신청서 양식에 해당 정보를 기입하고, 본 약관에 동의하여 서비스
          이용계약을 완료시키는 행위 3. 회 원 : 당 사이트에 필요한 개인 정보를
          제공하여 회원 등록을 한 자로서, 당 사이트의 정보 및 서비스를 이용할 수
          있는 자 4. 아이디 : 이용고객의 식별과 이용자가 서비스 이용을 위하여
          이용자가 정한 문자와 숫자의 조합 5. 비밀번호 : 아이디에 대한 본인
          여부를 확인하기 위하여 사용되는 문자, 숫자, 특수문자 등의 조합 6. 탈퇴
          : 서비스 또는 회원이 이용계약을 종료하는 행위 ② 본 약관에서 정의하지
          않은 용어는 개별서비스에 대한 별도 약관 및 이용규정에서 정의합니다. 제
          3 장 의무 및 책임 제 14 조 (당 사이트의 의무) ① 당 사이트는 법령과 본
          약관이 금지하거나 미풍양속에 반하는 행위를 하지 않으며, 지속적이고
          안정적으로 서비스를 제공하기 위해 노력할 의무가 있습니다. ② 당
          사이트는 회원의 개인 신상 정보를 본인의 승낙 없이 타인에게 누설,
          배포하지 않습니다. 다만, 전기통신관련법령 등 관계법령에 의하여 관계
          국가기관 등의 요구가 있는 경우에는 그러하지 아니합니다. ③ 당 사이트는
          이용자가 안전하게 당 사이트 서비스를 이용할 수 있도록 이용자의
          개인정보 (신용정보 포함) 보호를 위한 보안시스템을 갖추어야 합니다. ④
          당 사이트는 이용자의 귀책사유로 인한 서비스 이용 장애에 대하여 책임을
          지지 않습니다. 제 15 조 (회원의 의무) ① 회원 가입시에 요구되는 정보는
          정확하게 기입하여야 합니다. 또한 이미 제공된 회원에 대한 정보가 정확한
          정보가 되도록 유지, 갱신하여야 하며, 회원은 자신의 아이디 및
          비밀번호를 제3자에게 이용하게 해서는 안 됩니다. ② 회원은 당 사이트의
          사전 승낙 없이 서비스를 이용하여 어떠한 영리행위도 할 수 없습니다. ③
          회원은 당 사이트 서비스를 이용하여 얻은 정보를 당 사이트의 사전승낙
          없이 복사, 복제, 변경, 번역, 출판·방송 기타의 방법으로 사용하거나 이를
          타인에게 제공할 수 없습니다. ④ 이용자는 당 사이트 서비스 이용과
          관련하여 다음 각 호의 행위를 하여서는 안 됩니다. 1. 다른 회원의
          아이디를 부정 사용하는 행위 2. 범죄행위를 목적으로 하거나 기타
          범죄행위와 관련된 행위 3. 선량한 풍속, 기타 사회질서를 해하는 행위 4.
          타인의 명예를 훼손하거나 모욕하는 행위 5. 타인의 지적재산권 등의
          권리를 침해하는 행위 6. 해킹행위 또는 컴퓨터바이러스의 유포행위 7.
          타인의 의사에 반하여 광고성 정보 등 일정한 내용을 지속적으로 전송하는
          행위 8. 서비스의 안전적인 운영에 지장을 주거나 줄 우려가 있는 일체의
          행위 9. 당 사이트에 게시된 정보의 변경 제 4 장 기 타 제 16 조 (당
          사이트의 소유권) ① 당 사이트가 제공하는 서비스, 그에 필요한
          소프트웨어, 이미지, 마크, 로고, 디자인, 서비스명칭, 정보 및 상표 등과
          관련된 지적재산권 및 기타 권리는 당 사이트에 소유권이 있습니다. ②
          이용자는 당 사이트가 명시적으로 승인한 경우를 제외하고는 전항의 소정의
          각 재산에 대한 전부 또는 일부의 수정, 대여, 대출, 판매, 배포, 제작,
          양도, 재라이센스, 담보권 설정 행위, 상업적 이용 행위를 할 수 없으며,
          제3자로 하여금 이와 같은 행위를 하도록 허락할 수 없습니다. 제 17 조
          (양도금지) 회원이 서비스의 이용권한, 기타 이용계약 상 지위를 타인에게
          양도, 증여할 수 없으며, 이를 담보로 제공할 수 없습니다. 제 18 조
          (손해배상) 당 사이트는 무료로 제공되는 서비스와 관련하여 회원에게
          어떠한 손해가 발생하더라도 당 사이트가 고의로 행한 범죄행위를 제외하고
          이에 대하여 책임을 부담하지 아니합니다. 제 19 조 (면책조항) ① 당
          사이트는 서비스에 표출된 어떠한 의견이나 정보에 대해 확신이나 대표할
          의무가 없으며 회원이나 제3자에 의해 표출된 의견을 승인하거나
          반대하거나 수정하지 않습니다. 당 사이트는 어떠한 경우라도 회원이
          서비스에 담긴 정보에 의존해 얻은 이득이나 입은 손해에 대해 책임이
          없습니다. ② 당 사이트는 회원간 또는 회원과 제3자간에 서비스를 매개로
          하여 물품거래 혹은 금전적 거래 등과 관련하여 어떠한 책임도 부담하지
          아니하고, 회원이 서비스의 이용과 관련하여 기대하는 이익에 관하여
          책임을 부담하지 않습니다. 제 20 조 (관할법원) 본 서비스 이용과
          관련하여 발생한 분쟁에 대해 소송이 제기될 경우 대전지방법원을 전속적
          관할 법원으로 합니다. 부 칙 (시행일) 본 약관은 2018년 8월 1일부터
          시행됩니다. 개정된 약관의 적용일자 이전 이용자 또는 회원은 개정된
          이용약관의 적용을 받습니다.
        </div>
      </div>
    </div>
  );
}
